{"class_name": "Model", "keras_version": "1.1.1", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1002, 6], "input_dtype": "float32", "sparse": false, "name": "input_1"}, "inbound_nodes": [], "name": "input_1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 1002, 6], "input_dtype": "float32", "sparse": false, "name": "input_2"}, "inbound_nodes": [], "name": "input_2"}, {"class_name": "Convolution1D", "config": {"batch_input_shape": [null, null, 6], "W_constraint": null, "b_constraint": null, "name": "convolution1d_1", "activity_regularizer": null, "trainable": true, "filter_length": 34, "init": "glorot_uniform", "bias": true, "nb_filter": 32, "input_dtype": "float32", "subsample_length": 1, "border_mode": "valid", "input_dim": 6, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "input_length": null}, "inbound_nodes": [[["input_1", 0, 0]], [["input_2", 0, 0]]], "name": "convolution1d_1"}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_1"}, "inbound_nodes": [[["convolution1d_1", 0, 0]], [["convolution1d_1", 1, 0]]], "name": "dropout_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_1", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 32}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["dropout_1", 0, 0]], [["dropout_1", 1, 0]]], "name": "timedistributed_1"}, {"class_name": "MaxPooling1D", "config": {"stride": 17, "pool_length": 17, "trainable": true, "name": "maxpooling1d_1", "border_mode": "valid"}, "inbound_nodes": [[["timedistributed_1", 0, 0]], [["timedistributed_1", 1, 0]]], "name": "maxpooling1d_1"}, {"class_name": "Bidirectional", "config": {"merge_mode": "concat", "layer": {"class_name": "LSTM", "config": {"U_regularizer": null, "name": "forward_lstm_1", "inner_activation": "hard_sigmoid", "go_backwards": false, "activation": "tanh", "trainable": true, "unroll": false, "consume_less": "cpu", "stateful": false, "init": "glorot_uniform", "inner_init": "orthogonal", "dropout_U": 0.1, "dropout_W": 0.1, "input_dim": 32, "return_sequences": true, "b_regularizer": null, "W_regularizer": null, "output_dim": 32, "forget_bias_init": "one", "input_length": null}}, "trainable": true, "name": "bidirectional_1"}, "inbound_nodes": [[["maxpooling1d_1", 0, 0]], [["maxpooling1d_1", 1, 0]]], "name": "bidirectional_1"}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}, "inbound_nodes": [[["bidirectional_1", 0, 0]], [["bidirectional_1", 1, 0]]], "name": "dropout_2"}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_2", 0, 0]], [["dropout_2", 1, 0]]], "name": "flatten_1"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_2", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 64}, "inbound_nodes": [[["flatten_1", 0, 0]], [["flatten_1", 1, 0]]], "name": "dense_2"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8], "input_dtype": "float32", "sparse": false, "name": "input_3"}, "inbound_nodes": [], "name": "input_3"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_2", 0, 0], ["input_3", 0, 0]]], "name": "merge_1"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_2", 1, 0], ["input_3", 0, 0]]], "name": "merge_2"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 64}, "inbound_nodes": [[["merge_1", 0, 0]], [["merge_2", 0, 0]]], "name": "dense_3"}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_4", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "sigmoid", "output_dim": 1}, "inbound_nodes": [[["dense_3", 0, 0]], [["dense_3", 1, 0]]], "name": "dense_4"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "ave", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["dense_4", 0, 0], ["dense_4", 1, 0]]], "name": "merge_3"}], "input_layers": [["input_1", 0, 0], ["input_2", 0, 0], ["input_3", 0, 0]], "output_layers": [["merge_3", 0, 0]], "name": "model_1"}}